#### Terraform Initialization `success`
#### Terraform Plan `failure`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113700460392]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113700460362]
sakuracloud_dns.k8s_dns: Refreshing state... [id=113700460367]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113700460366]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113700460363]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113700460391]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113700460361]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113700460390]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113700460388]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113700460365]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113700460369]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113700460368]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947141]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113700460371]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113700460377]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113700460387]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113700460385]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113700460374]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113700460379]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113700460364]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113700460378]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113700460380]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113700460370]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113700460381]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113700460393]
sakuracloud_dns_record.k8s_apiserver_record: Refreshing state... [id=dnsrecord-3480868555]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113700460410]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113700460409]
sakuracloud_dns_record.root_record_ipv4: Refreshing state... [id=dnsrecord-995608698]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113700460431]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113700460432]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113700460427]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113700460443]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113700460430]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113700460428]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113700460429]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113700460445]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # sakuracloud_dns.k8s_dns has been deleted
  - resource "sakuracloud_dns" "k8s_dns" {
      - dns_servers = [
          - "ns1.gslb8.sakura.ne.jp",
          - "ns2.gslb8.sakura.ne.jp",
        ] -> null
      - id          = "113700460367" -> null
        tags        = []
      - zone        = "drove-dev.ictsc.net" -> null
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # sakuracloud_dns.k8s_dns will be created
  + resource "sakuracloud_dns" "k8s_dns" {
      + dns_servers = (known after apply)
      + id          = (known after apply)
      + zone        = "drove-dev.ictsc.net"

      + record (known after apply)
    }

  # sakuracloud_dns_record.k8s_apiserver_record will be created
  + resource "sakuracloud_dns_record" "k8s_apiserver_record" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "k8s"
      + ttl    = 300
      + type   = "A"
      + value  = "163.43.220.183"
    }

  # sakuracloud_dns_record.root_record_ipv4 will be created
  + resource "sakuracloud_dns_record" "root_record_ipv4" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 300
      + type   = "A"
      + value  = "163.43.220.184"
    }

  # sakuracloud_dns_record.root_record_ipv6 will be created
  + resource "sakuracloud_dns_record" "root_record_ipv6" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 300
      + type   = "AAAA"
      + value  = "2001:e42:407:1035::2:0"
    }

  # sakuracloud_dns_record.wildcard_record will be created
  + resource "sakuracloud_dns_record" "wildcard_record" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "*"
      + ttl    = 300
      + type   = "CNAME"
      + value  = "drove-dev.ictsc.net."
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113700460387",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-control-plane-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.220.177"
          + hostname        = "k8s-dev-control-plane-1"
          + ip_address      = "163.43.220.180"
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113700460366",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113700460372"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113700460369"
          + user_ip_address = "192.168.100.1"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113700460379",
          + "113700460361",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "k8s-dev-worker-node-3"
          + ip_address      = "192.168.100.103"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113700460366",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113700460369"
          + user_ip_address = "192.168.100.103"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[4] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113700460374",
          + "113700460363",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-5"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "k8s-dev-worker-node-5"
          + ip_address      = "192.168.100.105"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113700460366",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113700460369"
          + user_ip_address = "192.168.100.105"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[6] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113700460370",
          + "113700460388",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-7"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "k8s-dev-worker-node-7"
          + ip_address      = "192.168.100.107"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113700460366",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113700460369"
          + user_ip_address = "192.168.100.107"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ipv6_prefix                  = "2001:e42:407:1035::"
  + ipv6_prefix_len              = 64
  + k8s_control_plane_ip_address = [
      + (known after apply),
      + "163.43.220.181",
      + "163.43.220.182",
    ]
  + k8s_dns_nameservers          = (known after apply)
  + k8s_dns_zone                 = "drove-dev.ictsc.net"
  + k8s_worker_node_ip_address   = [
      + "192.168.100.101",
      + "192.168.100.102",
      + (known after apply),
      + "192.168.100.104",
      + (known after apply),
      + "192.168.100.106",
      + (known after apply),
      + "192.168.100.108",
    ]
  + max_ip_address               = "163.43.220.190"
  + min_ip_address               = "163.43.220.184"
  + vip_address                  = "163.43.220.183"
```

</details>